In [19]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder
import numpy as np

In [20]:
df = pd.read_csv("salary_data.csv")
df.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [21]:
df = df.rename(columns={
        'Age': 'age',
        'Gender': 'gender',
        "Education Level": "education", 
        "Job Title": "job_title",
        'Years of Experience': 'experience',
        'Salary': 'salary'
    })

In [22]:
df.head()

    age  gender   education          job_title  experience    salary
0  32.0    Male  Bachelor's  Software Engineer         5.0   90000.0
1  28.0  Female    Master's       Data Analyst         3.0   65000.0
2  45.0    Male         PhD     Senior Manager        15.0  150000.0
3  36.0  Female  Bachelor's    Sales Associate         7.0   60000.0
4  52.0    Male    Master's           Director        20.0  200000.0

In [23]:
df.shape

(375, 6)

In [24]:
df = df.dropna()

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 373 entries, 0 to 374
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         373 non-null    float64
 1   gender      373 non-null    object
 2   education   373 non-null    object
 3   job_title   373 non-null    object
 4   experience  373 non-null    float64
 5   salary      373 non-null    float64
dtypes: float64(3), object(3)
memory usage: 20.4+ KB

In [26]:
genderLE = LabelEncoder()
df['gender'] = np.array(genderLE.fit_transform(df['gender']))

eduLE = LabelEncoder()
df['education'] = np.array(eduLE.fit_transform(df['education']))

jobLE = LabelEncoder()

df['job_title'] = np.array(eduLE.fit_transform(df['job_title']))

In [27]:
df.head()

    age  gender  education  job_title  experience    salary
0  32.0       1          0        159         5.0   90000.0
1  28.0       0          1         17         3.0   65000.0
2  45.0       1          2        130        15.0  150000.0
3  36.0       0          0        101         7.0   60000.0
4  52.0       1          1         22        20.0  200000.0

In [28]:
df.to_csv('salary_data_clean.csv', index=False)